watsonlr/ebadge_ota/Apps/game_launcher/sdkconfig.defaults
# ESP-IDF target selection
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# ESP32S3 specific
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# SPI RAM (disabled for N8 variant)
CONFIG_SPIRAM=n

# WiFi for OTA
CONFIG_ESP_WIFI_ENABLED=y
